In [1]:
#instal
!pip install pandas

Requirement already satisfied: pandas in c:\users\prach\appdata\roaming\python\python311\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\prach\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\prach\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\prach\appdata\roaming\python\python311\site-packages (from pandas) (1.26.4)
Requirement already satisfied: six>=1.5 in c:\users\prach\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
#import 
import pandas as pd

In [4]:
#core data structure
s = pd.Series(['a',1,3,True])

In [5]:
print(s)

0       a
1       1
2       3
3    True
dtype: object

In [6]:
s1 = pd.Series(['a',1,3,True],index=['a','b','c','d'])

In [7]:
print(s1)

a       a
b       1
c       3
d    True
dtype: object

In [8]:
data = {'Name':['Namita','Diksha'],'id':[2,4]}

In [9]:
data

{'Name': ['Namita', 'Diksha'], 'id': [2, 4]}

In [13]:
df = pd.DataFrame(data)

In [11]:
print(df)

     Name  id
0  Namita   2
1  Diksha   4

In [15]:
df.head(1)

     Name  id
0  Namita   2

In [16]:
df1 = pd.Series(data)

In [17]:
df1

Name    [Namita, Diksha]
id                [2, 4]
dtype: object

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   id      2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [19]:
df.describe()

             id
count  2.000000
mean   3.000000
std    1.414214
min    2.000000
25%    2.500000
50%    3.000000
75%    3.500000
max    4.000000

In [20]:
df['id']

0    2
1    4
Name: id, dtype: int64

In [23]:
df[['id','Name']].head(1)

   id    Name
0   2  Namita

In [25]:
df[['id','Name']].tail(1)

   id    Name
1   4  Diksha

In [ ]:
loc - label based indexing
iloc - integer based  indexing

In [26]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}
df2 = pd.DataFrame(data, index=['a', 'b', 'c'])

In [27]:
df2.head()

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [28]:
df2.loc['a']

Name    Alice
Age        25
Name: a, dtype: object

In [29]:
df2.iloc[0]

Name    Alice
Age        25
Name: a, dtype: object

In [30]:
df2.iloc[1]

Name    Bob
Age      30
Name: b, dtype: object

In [35]:
df2.loc['a':'c']

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [32]:
l=[1,2,43,5,7]

In [33]:
l[1:3]

[2, 43]

In [36]:
df2.iloc[0:3]

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [ ]:
Reading data set

In [37]:
#csv

df = pd.read_csv('data.csv')

In [38]:
df

   ID     Name  Age Department  Salary    JoinDate
0   1    Alice   25         HR   30000  15-01-2022
1   2      Bob   30    Finance   50000  01-12-2021
2   3  Charlie   40         IT  100000  10-03-2022
3   4    Diana   36  Marketing   20000  20-08-2020
4   5      Eve   65         HR   35000  11-07-2019
5   6    Frank   23    Finance   45000  05-11-2022

In [40]:
df.head(2)

   ID   Name  Age Department  Salary    JoinDate
0   1  Alice   25         HR   30000  15-01-2022
1   2    Bob   30    Finance   50000  01-12-2021

In [41]:
df.tail(2)

   ID   Name  Age Department  Salary    JoinDate
4   5    Eve   65         HR   35000  11-07-2019
5   6  Frank   23    Finance   45000  05-11-2022

In [46]:
df.to_excel(r'C:\Users\prach\Desktop\aa_2.0_python\exxxel.xlsx',index=False)

In [43]:
df.to_json('jssss.json')

In [50]:
df=pd.read_excel(r'C:\Users\prach\Desktop\aa_2.0_python\exxxel.xlsx')

In [48]:
df.head()

   ID     Name  Age Department  Salary    JoinDate
0   1    Alice   25         HR   30000  15-01-2022
1   2      Bob   30    Finance   50000  01-12-2021
2   3  Charlie   40         IT  100000  10-03-2022
3   4    Diana   36  Marketing   20000  20-08-2020
4   5      Eve   65         HR   35000  11-07-2019

In [51]:
df1=pd.read_excel(r'C:\Users\prach\Desktop\aa_2.0_python\exxxel.xlsx',sheet_name='Sheet2')

In [52]:
df1

  name  salary
0  abc  100000
1  bcd  788999

In [54]:
df2=pd.read_csv('data.csv')

In [55]:
df2

Empty DataFrame
Columns: [ghjmknm,m m,,mjkl]
Index: []

In [56]:
#json data
df2=pd.read_json('jssss.json')

In [57]:
df2

   ID     Name  Age Department  Salary    JoinDate
0   1    Alice   25         HR   30000  15-01-2022
1   2      Bob   30    Finance   50000  01-12-2021
2   3  Charlie   40         IT  100000  10-03-2022
3   4    Diana   36  Marketing   20000  20-08-2020
4   5      Eve   65         HR   35000  11-07-2019
5   6    Frank   23    Finance   45000  05-11-2022

In [58]:
df2.to_parquet('new.parquet')

In [59]:
json_data = df2.to_json('json_file1',orient='split')

In [60]:
json_data = df2.to_json('json_file2',orient='table')

In [62]:
json_data = df2.to_json('json_file3')

In [63]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\prach\anaconda3\lib\site-packages (5.0.1)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [64]:
!pip install sqlalchemy pyodbc

Requirement already satisfied: sqlalchemy in c:\users\prach\anaconda3\lib\site-packages (2.0.25)
Requirement already satisfied: pyodbc in c:\users\prach\anaconda3\lib\site-packages (5.0.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\prach\appdata\roaming\python\python311\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\prach\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [65]:
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=PRACHI\SQLEXPRESS01;'  # Your server name
    r'DATABASE=PK_TEST_DB;'         # Correct database name
    r'Trusted_Connection=yes;'      # For Windows Authentication
)

In [67]:
import pyodbc


conn = pyodbc.connect(conn_str)

In [69]:
query = "SELECT * FROM [dbo].[Employees]"

In [70]:
query

'SELECT * FROM [dbo].[Employees]'

In [77]:
df = pd.read_sql(query,conn)

C:\Users\prach\AppData\Local\Temp\ipykernel_23972\785092515.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

In [78]:
df

   EmployeeID FirstName LastName  DepartmentID  Salary    HireDate
0           1      John      Doe            10  5500.0  2020-01-15
1           2      Jane    Smith            20  7000.0  2018-03-25
2           3     Alice  Johnson            10  4800.0  2021-07-10
3           4       Bob    Brown            30  6200.0  2019-11-05
4           5   Charlie    Davis            20  7200.0  2017-05-20
5           6       Eve   Wilson            30  4000.0  2022-02-14

In [81]:
df1_filtered=df[df['Salary']>5000]

In [82]:
df1_filtered

   EmployeeID FirstName LastName  DepartmentID  Salary    HireDate
0           1      John      Doe            10  5500.0  2020-01-15
1           2      Jane    Smith            20  7000.0  2018-03-25
3           4       Bob    Brown            30  6200.0  2019-11-05
4           5   Charlie    Davis            20  7200.0  2017-05-20

In [85]:
df[df['Salary']>5000]

   EmployeeID FirstName LastName  DepartmentID  Salary    HireDate
0           1      John      Doe            10  5500.0  2020-01-15
1           2      Jane    Smith            20  7000.0  2018-03-25
3           4       Bob    Brown            30  6200.0  2019-11-05
4           5   Charlie    Davis            20  7200.0  2017-05-20

In [87]:
df[df['Salary']>5000][['EmployeeID','FirstName','LastName']]

   EmployeeID FirstName LastName
0           1      John      Doe
1           2      Jane    Smith
3           4       Bob    Brown
4           5   Charlie    Davis

In [89]:
df[df['Salary']>5000]

   EmployeeID FirstName LastName  DepartmentID  Salary    HireDate
0           1      John      Doe            10  5500.0  2020-01-15
1           2      Jane    Smith            20  7000.0  2018-03-25
3           4       Bob    Brown            30  6200.0  2019-11-05
4           5   Charlie    Davis            20  7200.0  2017-05-20

In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\prach\appdata\roaming\python\python311\site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\prach\appdata\roaming\python\python311\site-packages (from mysql-connector-python) (4.21.12)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import mysql.connector

In [3]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "8889"
)

In [4]:
cursor = conn.cursor()

In [5]:
cursor.execute("CREATE DATABASE IF NOT EXISTS panadas_db")

In [6]:
cursor.execute("USE panadas_db")

In [9]:
cursor.execute("CREATE TABLE IF NOT EXISTS pd_tbl (Name VARCHAR(30),Id INT,Salary FLOAT)")

In [11]:
cursor.execute("INSERT INTO pd_tbl VALUES ('Sahil',2,5000000)")

In [12]:
conn.commit()

In [13]:
cursor.execute("INSERT INTO pd_tbl VALUES ('Diksha',3,6000000)")

In [14]:
conn.commit()

In [15]:
cursor.close()

True

In [16]:
conn.close()

In [17]:
import pandas as pd

In [22]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "8889"
)
cursor = conn.cursor()
cursor.execute("CREATE DATABASE database_db1")

In [23]:
cursor.execute("CREATE DATABASE database_db2")

In [24]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "8889"
)

In [27]:
cursor = conn.cursor()
cursor.execute("CREATE DATABASE database_db3")

In [28]:
cursor.close()

True

In [29]:
conn.close()

In [30]:
cursor.execute("CREATE DATABASE database_db3")

ProgrammingError: Cursor is not connected

In [34]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "8889",
   
)

In [35]:
conn.close()

In [36]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="8889",
    database="panadas_db"  # Specify the database name
)

In [38]:
df = pd.read_sql("SELECT * FROM pd_tbl",conn)

C:\Users\prach\AppData\Local\Temp\ipykernel_29532\2047848543.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM pd_tbl",conn)

In [39]:
df.head()

     Name  Id     Salary
0   Sahil   2  5000000.0
1   Sahil   2  5000000.0
2  Diksha   3  6000000.0

In [41]:
df.to_csv("pd_tbl.csv",index=False)

In [42]:
data = {'name':['Suraj','Sonam'],'id':[1,2]}

In [43]:
df = pd.DataFrame(data)

In [44]:
df

    name  id
0  Suraj   1
1  Sonam   2

In [46]:
from sqlalchemy import create_engine

In [47]:
engine = ('mysql+mysqlconnector://root:8889@localhost/new_database_name')

In [49]:
df.to_sql(name='new1',con=engine,if_exists='append',index=False)

-1

In [50]:
df.to_sql(name='new1',con=engine,if_exists='overwrite',index=False)

ValueError: 'overwrite' is not valid for if_exists

In [51]:
data = pd.DataFrame({'level': ['Junior', 'Mid-level', 'Senior'],
                      'salary': [7500, 14650, 18320],
                      'position': ['Data Analyst', 'Data Scientist', 'Data Engineer']})

In [52]:
data.head()

       level  salary        position
0     Junior    7500    Data Analyst
1  Mid-level   14650  Data Scientist
2     Senior   18320   Data Engineer

In [82]:
file_path = 'database.db'

In [83]:
import os
if os.path.exists(file_path):
    try:
        os.remove(file_path)
        print(f"File {file_path} deleted successfull")
    except Exception as e:
        print(f"Error deleting the file {file_path}. Details: {e}")
else:
    print(f"File {file_path} not found")

Error deleting the file database.db. Details: [WinError 32] The process cannot access the file because it is being used by another process: 'database.db'

In [84]:
import sqlite3
cnn = sqlite3.connect(file_path)

In [78]:
data.to_sql('employee1',cnn)

3

In [63]:
!pip install -q -U watermark

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [69]:
%load_ext watermark
%watermark -v -p pandas,numpy,matplotlib

Python implementation: CPython
Python version       : 3.11.7
IPython version      : 8.20.0

pandas    : 1.5.3
numpy     : 1.26.4
matplotlib: 3.8.0

In [70]:
!pip install -q ipython-sql

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [85]:
%sql sqlite:///database_PK.db

In [86]:
%reload_ext sql

In [94]:
cnn.close()

In [88]:
file_path = 'table_db.db'

In [89]:
if os.path.exists(file_path):
    try:
        os.remove(file_path)
        print(f"File {file_path} deleted successfully!")
    except Exception as e:
        print(f"Error deleting the file {file_path}. Details: {e}")
else:
    print(f"File {file_path} not found.")

File table_db.db not found.

In [90]:
cnn = sqlite3.connect(file_path)

In [91]:
data.to_sql('employees', cnn)

3

In [92]:
%sql sqlite:///table_db.db

In [93]:
%%sql

SELECT * FROM employees

   sqlite:///database.db
   sqlite:///database_PK.db
 * sqlite:///table_db.db
Done.

KeyError: 'DEFAULT'

In [95]:
cnn.close()